const idioms = [
    { text: "莫逆之交", img: "莫逆之交.jpg", def: "指情投意合，至好無嫌的好友。", ex: "他倆在夜市裏的小吃店工作，彼此互相扶持，堪稱莫逆之交。"},
    { text: "風花雪月", img: "風花雪月.jpg", def: "原指四時景色，今則指：（1）男女情愛；（2）花天酒地的荒淫生活。", ex: "（1）那本小説的内容全爲風花雪月之事，研究價值不高。（2）他不務正業，又常涉足風花雪月的場所，最後導妻離子散。"},
    { text: "冰清玉潔", img: "冰清玉潔.jpg", def: "象冰那樣清澈， 相玉那樣結拜。比喻人品行高潔。又作 '玉潔冰清'。", ex: "小瑩雖然身處是非之處，但依然保有冰清玉潔的節操，令人佩服。" },
    { text: "白頭偕老", img: "白頭偕老.jpg", def: "形容夫妻恩愛到老。偕，共同。", ex: "新人們都希望自己能與另一半白頭偕老，富貴雙全。" },
    { text: "臨陣磨槍", img: "臨陣磨槍.jpg", def: "到了上陣前才開始磨槍。比喻事態急迫，匆忙應變。", ex: "他每次都在月考前才臨陣磨槍，難怪成績不理想。" },
  
    { text: "一絲不苟", img: "一絲不苟.jpg", def: "做事認真，一點也不馬虎。", ex: "班長的工作態度一絲不苟，所以老師很放心把事情交代給他。" },
    { text: "弱不禁風", img: "弱不禁風.jpg", def: "形容身體虛弱，連風吹都承受不住。", ex: "他原本弱不禁風的身體，經過長期的鍛煉，現在變得十分强壯。" },
    { text: "槁木死灰", img: "槁木死灰.jpg", def: "枯乾的樹木和火滅後的灰燼。形容人遭受挫折而灰心絕望，意志消沉。", ex: "小鈴因爲失戀，每天過著槁木死灰般的生活，極需好友的關懷。" },
    { text: "匹夫之勇", img: "匹夫之勇.jpg", def: "指有勇而無謀的血氣之勇。匹夫，平民，百姓。", ex: "單憑匹夫之勇無法成爲優秀的領導者，還需具備智慧和仁德。" },
    { text: "烘雲托月", img: "烘雲托月.jpg", def: "比喻不從正面描繪而從側面點染，以烘托出所要表現的重點。", ex: "他擅長以烘雲托月的手法，來塑造小説人物的個性。" },
  
    { text: "嶔崎磊落", img: "嶔崎磊落.jpg", def: "比喻人的品格高潔，有骨氣。", ex: "小勛的爸爸是個嶔崎磊落，不畏强權的正人君子。" },
    { text: "跋山涉水", img: "跋山涉水.jpg", def: "形容旅途遙遠，過程艱苦。", ex: "小慧爲了找尋失散多年的雙親，一路跋山涉水，卻從不喊累。" },
    { text: "閉月羞花", img: "閉月羞花.jpg", def: "使月亮躲藏，使花兒羞慚。形容女子容貌姣好出色。", ex: "玉婷的美，用閉月羞花，傾國傾城來形容一點也不為過。" },
    { text: "夙興夜寐", img: "夙興夜寐.jpg", def: "早起晚睡，比喻勤勞。夙，早晨；寐，睡。", ex: "我的父親總是夙興夜寐，努力工作，辛苦的為家庭的生計打拼。" },
    { text: "衆星拱月", img: "衆星拱月.jpg", def: "比喻許多人共同簇擁一個人。", ex: "新娘在六位伴娘的簇擁下走進禮堂，形成一幅衆星拱月的美麗畫面。" },
  
    { text: "夙夜匪懈", img: "夙夜匪懈.jpg", def: "日夜勤奮不懈怠。匪，不。", ex: "小瑞爲了此次考試，半年來夙夜匪懈，拼命苦讀，如今終於金榜題名。" },
    { text: "春花秋月", img: "春花秋月.jpg", def: "（1）汎指春秋美景；（2）比喻美好的時光與景物。", ex: "（2）每當小祥看到舊照片，總會懷念那段春花秋月的往事。" },
    { text: "披星戴月", img: "披星戴月.jpg", def: "形容早出晚歸，旅途勞累。", ex: "這一路上披星戴月，跋山涉水，最後終於把物資送到災民的手中。" },
    { text: "海納百川", img: "海納百川.jpg", def: "比喻包容的東西非常廣汎，盡心接納事物", ex: "以小嘉海納百川的個性，一定不會跟你計較這點小事物的。" },
    { text: "厲兵秣馬", img: "厲兵秣馬.jpg", def: "完成作戰前的準備。有做‘秣馬厲兵’。厲兵，磨利兵器。秣馬，喂馬。", ex: "我軍厲兵秣馬，已完成備戰工作。" },
  
    { text: "光風霽月", img: "光風霽月.jpg", def: "原指雨過天晴後的明净景象，今則比喻；（1）政治清明的局面；（2）人坦蕩高潔的胸懷品格。霽，指雨後轉晴。", ex: "（2）小翔爲人光風霽月，值得深交。" },
    { text: "休休有容", img: "休休有容.jpg", def: "比喻君子寬宏有氣量。休休，表示樂善而寬大的樣子。", ex: "班長待人謙卑有禮，休休有容，所以人緣極佳。" },
    { text: "直言不諱", img: "直言不諱.jpg", def: "説話坦率，無所顧忌。", ex: "他直言不諱的向主管指出目前工作上的缺失。" },
    { text: "窮兵黷武", img: "窮兵黷武.jpg", def: "任意的連用兵力，發動戰爭。窮，解禁；黷，隨便，任意。", ex: "第二次世界大戰期間，德國希特勒窮兵黷武，只爲了稱霸世界的欲望。" },
    { text: "胼手胝足", img: "胼手胝足.jpg", def: "手掌和交底的皮膚皆因勞動過度而磨出厚繭。形容極為辛勞。", ex: "這片良田是他胼手胝足開墾出來的。" },

    { text: "星火燎原", img: "星火燎原.jpg", def: "小火點也可以把整個原野燒起來。比喻小事情也能釀成大災禍，或指微小的力量，也能發展成强大的勢力。",  ex: "所謂 ‘星火燎原’， 小小的烟蒂也可能釀成森林大火，不可不慎。" },
    { text: "鏡花水月", img: "鏡花水月.jpg", def: "鏡中的花，水裏的月。比喻空幻不實在的事物。", ex: "財富是許多人汲汲追求的東西，但它其實有如鏡花水月，無法長久保存。" },
    { text: "流金鑠石", img: "流金鑠石.jpg", def: "形容天氣非常炎熱。鑠，鎔化。", ex: "在流金鑠石的夏天裏，如果能喝一杯冰涼的果汁，實在是一大享受！" },
    { text: "浮生若夢", img: "浮生若夢.jpg", def: "人生像夢一般的短暫，虛幻。形容光陰易逝，人生無常。", ex: "浮生若夢，財富和名利就有如過烟雲煙，是在不需爲了這些你爭我奪。" },
    { text: "月下老人", img: "月下老人.jpg", def: "原指主管婚姻的神仙，今借指媒人簡稱 ‘月老’。", ex: "冠伶常常幫同事牽綫，促成許多良緣，是名副其實的月下老人。" },

    { text: "斗杓東指", img: "斗杓東指.jpg", def: "斗柄指向東方，代表春季來臨。", ex: "歲月易逝，轉眼間又到了斗杓東指，百花盛開的季節。" },
    { text: "南極星輝", img: "南極星輝.jpg", def: "祝福男性長輩，如南極星一般吉祥長壽，通常用作生日賀詞。", ex: "爺爺在八十嵗的生日宴會上，收到一塊有 ‘南極星輝’ 題字的匾額。" },
    { text: "月滿則虧", img: "月滿則虧.jpg", def: "月亮到最圓時，就會開始缺損。比喻事物發展到極盛時就會開始衰退。", ex: "叔叔現在的事業如日中天，但仍牢記守成不易，月滿則虧的道理。" },
    { text: "鍾鳴漏盡", img: "鍾鳴漏盡.jpg", def: "夜半鍾響，計時的沙漏也將滴完。（1）指深夜時分；（2）比喻殘年，晚年。漏，滴漏，沙漏，為古代計是器", ex: "（1）爲了考上好學校，哥哥每天讀書都讀到鍾鳴漏盡才上床睡覺。（2）他雖然已到鍾鳴漏盡之年，但還是堅持自己的夢想。" },
    { text: "急如星火", img: "急如星火.jpg", def: "如流星的光那樣急速，形容情勢非常的緊急。", ex: "這件事急如星火，若不馬上處理，將會造成失分嚴重的後果。" },

    { text: "難言之隱", img: "難言之隱.jpg", def: "難以説出口的事情，隱，痛苦。", ex: "看他吞吞吐吐的樣子，似乎有難言之隱，你就別再逼他了。" },
    { text: "逆水行舟", img: "逆水行舟.jpg", def: "你這水流的方向行船。比喻人如果學習或者做事情不努力，就會退步。", ex: "我們要時時提醒自己；學如逆水行舟，不進則退。" },
    { text: "離鄉背井", img: "離鄉背井.jpg", def: "之離開了故鄉，到外地生活。", ex: "爲了將來的前途，小黃不得不離鄉背井，到外地工作賺錢。" },
    { text: "閑雲野鶴", img: "閑雲野鶴.jpg", def: "漂浮的雲，野生的鶴。比喻來去自如，務所牽絆的人。", ex: "小澤不想一生都被名利所束縛，只想自由自在，過著閑雲野鶴般的生活。" },
    { text: "鶴立鷄群", img: "鶴立鷄群.jpg", def: "像鶴站在雞群中般突出。（1）比喻人的才能超群；（2）形容人的身材高大。", ex: "（1）小米多才多藝，讓她在同伴之中顯得鶴立鷄群。（2）雖然小佑打扮樸素，但因爲個子高大，在人群中顯得鶴立鷄群。" },
    
    { text: "駕鶴西歸", img: "駕鶴西歸.jpg", def: "人死的婉轉説法。", ex: "隔壁的王伯伯多年臥病在床，已於上個月駕鶴西歸了。" },
    { text: "暮鼓晨鐘", img: "暮鼓晨鐘.jpg", def: "佛寺中朝課之前和熄燈之前指會敲擊鐘鼓。比喻使人驚醒覺悟的語言。又作 ‘晨鐘暮鼓’。", ex: "這篇文章的理論精彩，如同暮鼓晨鐘般發人深省。" },
    { text: "踽踽獨行", img: "踽踽獨行.jpg", def: "孤單地走著。踽踽，孤零零的樣子。", ex: "電影的最後一幕，只見主角於街上踽踽獨行，十分凄涼。" },
    { text: "鷄皮鶴髮", img: "鷄皮鶴髮.jpg", def: "皮膚發皺像鷄皮，頭髮蒼白如鶴毛。形容老人的形貌。", ex: "清晨的公園裏，縂有許多鷄皮和毛的老人家在運動。" },
    { text: "鵬程萬里", img: "鵬程萬里.jpg", def: "大鵬鳥一飛機數千里。后比喻前程遠大，不可限量。常用作臨別贈語。", ex: "畢業前夕，同學們互相·勉勵對方鵬程萬里。" },

    { text: "鴻圖大展", img: "鴻圖大展.jpg", def: "祝賀別人得以發展遠大的志向或計劃的用語。", ex: "今天是您新公司開幕的日子，祝您鴻圖大展，公司業續蒸蒸日上。" },
    { text: "孤掌難鳴", img: "孤掌難鳴.jpg", def: "一個巴掌拍不出聲響。比喻孤立無助，難以成事。", ex: "遇到困難時，要尋求協助，免得鼓掌難鳴，最後一事無成。" },
    { text: "孤家寡人", img: "孤家寡人.jpg", def: "原爲古代帝王的目稱，后比喻孤立無助，隻身一人。", ex: "小惠已年過四十仍然未婚，過著孤家寡人的生活。" },
    { text: "順水推舟", img: "順水推舟.jpg", def: "順著水流的方向推船，比喻順應當時的情勢行事。", ex: "小勳的實力不差，我只是順水推舟地拉他一把，讓他有出人頭地的機會。" },
    { text: "前功盡棄", img: "前功盡棄.jpg", def: "將以往辛苦建立的功勞，全部去除，即以前的努力全部白費的意思。", ex: "爲了有好成績，無論多辛苦都要堅持，一旦半途而廢，就會前功盡棄。" }
];